fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ВКМ_ОбслуживаниеКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

// {{ Таркашова Н.Г. 11.05.2026 
// Процедура выполняет автозаполнение табличной части документа
// на основе договора и данных регистра выполненных работ.
// Вызывается из формы документа, если договор имеет вид "Абонентское обслуживание".
Процедура ВыполнитьАвтозаполнение(СуммаАбонентскойПлаты = Неопределено, Период = Неопределено) Экспорт
    
    // 1. Получить значения констант (номенклатура)
    НоменклатураАП = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
    НоменклатураРС = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
    
    // Проверка заполнения констант
    Если НоменклатураАП = Справочники.Номенклатура.ПустаяСсылка()
       Или НоменклатураРС = Справочники.Номенклатура.ПустаяСсылка() Тогда
        ВызватьИсключение "Не заполнены константы номенклатуры для автозаполнения. Обратитесь к администратору.";
    КонецЕсли;
    
    // 2. Очистка табличной части
    Товары.Очистить();
    Услуги.Очистить();
    
    // 3. Заполнение абонентской платы
    Если СуммаАбонентскойПлаты = Неопределено Тогда
        // Если сумма не передана, получим из справочника 
		Запрос = Новый Запрос;
        Запрос.Текст = "ВЫБРАТЬ
                       |	ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты, 0) КАК Сумма
                       |ИЗ
                       |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
                       |ГДЕ
                       |	ДоговорыКонтрагентов.Ссылка = &Договор";
        Запрос.УстановитьПараметр("Договор", Договор);
        Выборка = Запрос.Выполнить().Выбрать();
        Выборка.Следующий();
        СуммаАбонентскойПлаты = Выборка.Сумма;
    КонецЕсли;
    
    Если СуммаАбонентскойПлаты > 0 Тогда
        // Добавляем строку в табличную часть Услуги
		СтрокаУслуги = Услуги.Добавить();
		СтрокаУслуги.Номенклатура = НоменклатураАП;
		СтрокаУслуги.Количество = 1; // Условно 1 месяц
		СтрокаУслуги.Цена = СуммаАбонентскойПлаты;
		СтрокаУслуги.Сумма = СтрокаУслуги.Количество * СтрокаУслуги.Цена;
	КонецЕсли;
    
    // 4. Заполнение выполненных работ за период
    Если Период = Неопределено Тогда
        // Определяем месяц по дате документа
        НачалоМесяца = НачалоМесяца(Дата);
        КонецМесяца = КонецМесяца(Дата);
    Иначе
        НачалоМесяца = Период.ДатаНачала;
        КонецМесяца = Период.ДатаОкончания;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов, 0)) КАК КоличествоЧасов,
        |	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате, 0)) КАК СуммаКОплате,
        |	ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Ссылка КАК Регистратор
        |ИЗ
        |	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
        |ГДЕ
        |	ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
        |	И ВКМ_ВыполненныеКлиентуРаботы.Клиент = &Контрагент
        |	И ВКМ_ВыполненныеКлиентуРаботы.Договор = &Договор
        |
        |СГРУППИРОВАТЬ ПО
        |	ВКМ_ВыполненныеКлиентуРаботы.Регистратор.Ссылка";
    
    Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца);
    Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца);
    Запрос.УстановитьПараметр("Договор", Договор);
    Запрос.УстановитьПараметр("Контрагент", Контрагент);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        СтрокаТовара = Товары.Добавить();
        СтрокаТовара.Номенклатура = НоменклатураРС;
        СтрокаТовара.Количество = Выборка.КоличествоЧасов;
        СтрокаТовара.Сумма = Выборка.СуммаКОплате;
        Если Выборка.КоличествоЧасов <> 0 Тогда
            СтрокаТовара.Цена = Выборка.СуммаКОплате / Выборка.КоличествоЧасов;
        КонецЕсли;
        // Заполняем основание
        Если Выборка.Регистратор <> Неопределено Тогда
            Основание = Выборка.Регистратор;
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
    Если ЭтотОбъект.Договор.Пустая() Тогда
        Возврат; // Договор не заполнен, проверку не отключаем
    КонецЕсли;
    
    // Получаем вид договора напрямую
    ВидДоговора = ЭтотОбъект.Договор.ВидДоговора;
    
    Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
        ПутьКРеквизиту = ПроверяемыеРеквизиты.Найти("Основание");
        Если ПутьКРеквизиту <> Неопределено Тогда
            ПроверяемыеРеквизиты.Удалить(ПутьКРеквизиту); 
		КонецЕсли;
    КонецЕсли;	

КонецПроцедуры
// Таркашова Н.Г. 11.05.2026  }}

#КонецОбласти

#КонецЕсли
